#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_password.staging_db_password: Refreshing state... [id=none]
random_password.dlr_database_password: Refreshing state... [id=none]
random_password.database_password: Refreshing state... [id=none]
random_password.dlr_staging_db_password: Refreshing state... [id=none]
google_project_service.maps: Refreshing state... [id=venture-capitol/maps-backend.googleapis.com]
google_project_service.places: Refreshing state... [id=venture-capitol/places-backend.googleapis.com]
google_project_service.run: Refreshing state... [id=venture-capitol/run.googleapis.com]
google_project_service.iam: Refreshing state... [id=venture-capitol/iam.googleapis.com]
google_project_service.secretmanager: Refreshing state... [id=venture-capitol/secretmanager.googleapis.com]
google_project_service.sql: Refreshing state... [id=venture-capitol/sqladmin.googleapis.com]
google_storage_bucket.frontend_staging: Refreshing state... [id=vc-frontend-staging]
google_storage_default_object_access_control.public_access: Refreshing state... [id=vc-frontend-staging/allUsers]
google_secret_manager_secret.staging_db_connection_string: Refreshing state... [id=projects/venture-capitol/secrets/staging_db_connection_string]
google_service_account.dlr_backend_sa: Refreshing state... [id=projects/venture-capitol/serviceAccounts/dlr-backend-sa@venture-capitol.iam.gserviceaccount.com]
google_service_account.backend_sa: Refreshing state... [id=projects/venture-capitol/serviceAccounts/backend-sa@venture-capitol.iam.gserviceaccount.com]
google_service_account.dlr_staging_backend_sa: Refreshing state... [id=projects/venture-capitol/serviceAccounts/dlr-backend-staging-sa@venture-capitol.iam.gserviceaccount.com]
google_secret_manager_secret.dlr_staging_db_connection_string: Refreshing state... [id=projects/venture-capitol/secrets/dlr_staging_db_connection_string]
google_secret_manager_secret.dlr_db_connection_string: Refreshing state... [id=projects/venture-capitol/secrets/dlr_db_connection_string]
google_sql_database_instance.vc_db: Refreshing state... [id=vc-backend-database]
google_secret_manager_secret.db_connection_string: Refreshing state... [id=projects/venture-capitol/secrets/db_connection_string]
google_secret_manager_secret_iam_binding.dlr_db_connection_string_access: Refreshing state... [id=projects/venture-capitol/secrets/dlr_db_connection_string/roles/secretmanager.secretAccessor]
google_secret_manager_secret_iam_binding.dlr_staging_db_connection_string: Refreshing state... [id=projects/venture-capitol/secrets/dlr_staging_db_connection_string/roles/secretmanager.secretAccessor]
google_project_iam_binding.service_permissions["cloudsql.client"]: Refreshing state... [id=venture-capitol/roles/cloudsql.client]
google_project_iam_binding.service_permissions["run.admin"]: Refreshing state... [id=venture-capitol/roles/run.admin]
google_secret_manager_secret_iam_binding.staging_db_connection_string: Refreshing state... [id=projects/venture-capitol/secrets/staging_db_connection_string/roles/secretmanager.secretAccessor]
google_secret_manager_secret_iam_binding.db_connection_string_access: Refreshing state... [id=projects/venture-capitol/secrets/db_connection_string/roles/secretmanager.secretAccessor]
google_sql_user.database_user: Refreshing state... [id=backend_user//vc-backend-database]
google_sql_database.dlr_staging_backend_database: Refreshing state... [id=projects/venture-capitol/instances/vc-backend-database/databases/dlr_staging_backend]
google_secret_manager_secret_version.db_connection_string_data: Refreshing state... [id=projects/122736358705/secrets/db_connection_string/versions/1]
google_sql_database.dlr_backend_database: Refreshing state... [id=projects/venture-capitol/instances/vc-backend-database/databases/dlr_backend]
google_secret_manager_secret_version.staging_db_connection_string: Refreshing state... [id=projects/122736358705/secrets/staging_db_connection_string/versions/3]
google_sql_user.dlr_database_user: Refreshing state... [id=dlr_backend_user//vc-backend-database]
google_sql_database.staging_backend_database: Refreshing state... [id=projects/venture-capitol/instances/vc-backend-database/databases/staging_backend]
google_secret_manager_secret_version.dlr_staging_db_connection_string: Refreshing state... [id=projects/122736358705/secrets/dlr_staging_db_connection_string/versions/2]
google_secret_manager_secret_version.dlr_db_connection_string_data: Refreshing state... [id=projects/122736358705/secrets/dlr_db_connection_string/versions/1]
google_sql_user.staging_database_user: Refreshing state... [id=staging_backend_user//vc-backend-database]
google_sql_database.backend_database: Refreshing state... [id=projects/venture-capitol/instances/vc-backend-database/databases/backend]
google_sql_user.dlr_staging_database_user: Refreshing state... [id=dlr_staging_backend_user//vc-backend-database]
google_cloud_run_service.backend: Refreshing state... [id=locations/europe-west1/namespaces/venture-capitol/services/vc-backend]
google_cloud_run_service.staging_backend: Refreshing state... [id=locations/europe-west1/namespaces/venture-capitol/services/vc-backend-staging]
google_cloud_run_service.dlr_staging_backend: Refreshing state... [id=locations/europe-west1/namespaces/venture-capitol/services/dlr-backend-staging]
google_cloud_run_service.dlr_backend: Refreshing state... [id=locations/europe-west1/namespaces/venture-capitol/services/dlr-backend]
google_cloud_run_service_iam_policy.gpf_staging_noauth: Refreshing state... [id=v1/projects/venture-capitol/locations/europe-west1/services/vc-backend-staging]
google_cloud_run_service_iam_policy.gpf_noauth: Refreshing state... [id=v1/projects/venture-capitol/locations/europe-west1/services/vc-backend]
google_cloud_run_service_iam_policy.dlr_noauth: Refreshing state... [id=v1/projects/venture-capitol/locations/europe-west1/services/dlr-backend]
google_cloud_run_service_iam_policy.dlr_staging_noauth: Refreshing state... [id=v1/projects/venture-capitol/locations/europe-west1/services/dlr-backend-staging]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_service.backend will be updated in-place
  ~ resource "google_cloud_run_service" "backend" {
        id                         = "locations/europe-west1/namespaces/venture-capitol/services/vc-backend"
        name                       = "vc-backend"
        # (4 unchanged attributes hidden)


      ~ template {

          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-west1-docker.pkg.dev/venture-capitol/images/backend:8c14a7" -> "europe-west1-docker.pkg.dev/venture-capitol/images/backend:5bbd0e"
                    # (2 unchanged attributes hidden)



                    # (3 unchanged blocks hidden)
                }
            }
            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_service.dlr_backend will be updated in-place
  ~ resource "google_cloud_run_service" "dlr_backend" {
        id                         = "locations/europe-west1/namespaces/venture-capitol/services/dlr-backend"
        name                       = "dlr-backend"
        # (4 unchanged attributes hidden)


      ~ template {

          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-west1-docker.pkg.dev/venture-capitol/images/dlr:8c14a7" -> "us-docker.pkg.dev/cloudrun/container/hello"
                    # (2 unchanged attributes hidden)



                    # (3 unchanged blocks hidden)
                }
            }
            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_service.dlr_staging_backend will be updated in-place
  ~ resource "google_cloud_run_service" "dlr_staging_backend" {
        id                         = "locations/europe-west1/namespaces/venture-capitol/services/dlr-backend-staging"
        name                       = "dlr-backend-staging"
        # (4 unchanged attributes hidden)


      ~ template {

          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-west1-docker.pkg.dev/venture-capitol/images/dlr:8c14a7" -> "us-docker.pkg.dev/cloudrun/container/hello"
                    # (2 unchanged attributes hidden)



                    # (3 unchanged blocks hidden)
                }
            }
            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_service.staging_backend will be updated in-place
  ~ resource "google_cloud_run_service" "staging_backend" {
        id                         = "locations/europe-west1/namespaces/venture-capitol/services/vc-backend-staging"
        name                       = "vc-backend-staging"
        # (4 unchanged attributes hidden)


      ~ template {

          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-west1-docker.pkg.dev/venture-capitol/images/backend:8c14a7" -> "europe-west1-docker.pkg.dev/venture-capitol/images/backend:5bbd0e"
                    # (2 unchanged attributes hidden)



                    # (3 unchanged blocks hidden)
                }
            }
            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_storage_bucket.media_storage will be created
  + resource "google_storage_bucket" "media_storage" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EUROPE-WEST1"
      + name                        = "vc-media"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + cors {
          + max_age_seconds = 86400
          + method          = [
              + "GET",
              + "HEAD",
              + "PUT",
              + "OPTIONS",
            ]
          + origin          = [
              + "https://venturecapitol.de",
              + "https://staging.venturecapitol.de",
            ]
          + response_header = [
              + "*",
            ]
        }
    }

Plan: 1 to add, 4 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>